{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8", "config": [{"class_name": "Masking", "config": {"trainable": true, "name": "masking_1", "mask_value": -1, "dtype": "float32", "batch_input_shape": [null, 3, 10]}}, {"class_name": "LSTM", "config": {"trainable": true, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "name": "lstm_1", "activity_regularizer": null, "unit_forget_bias": true, "implementation": 0, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 3, 10], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "stateful": false, "dropout": 0.2, "return_sequences": false, "unroll": false, "recurrent_regularizer": null, "units": 32, "use_bias": true, "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "dtype": "float32", "units": 6, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}